export interface MenuItem {
  id: string;
  name: string;
  price: number;
  description: string;
  image?: string;
}

export interface MenuCategory {
  id: string;
  name: string;
  emoji: string;
  items: MenuItem[];
}

export const menu: MenuCategory[] = [
  {
    id: "go-box",
    name: "Go Box",
    emoji: "🍔🍟📦",
    items: [
      {
        id: "351024",
        name: "Go Box",
        price: 1310,
        description: "Мини чизбургери ×8, чикен стрипс ×4, нагетс ×12, помфрит ×4, сос ×4",
        image: "https://korpa.ba/product_uploads/yCn1q0oeFmAJCLGUcgVMZhkuMohOzUbw.jpg"
      },
      {
        id: "354626",
        name: "12 x Mini Cheeseburgers",
        price: 1470,
        description: "",
        image: ""
      },
      {
        id: "354627",
        name: "12 x Mini Lospolos",
        price: 1470,
        description: "",
        image: ""
      }
    ]
  },
  {
    id: "burgers",
    name: "Burgers",
    emoji: "🍔",
    items: [
      {
        id: "311158",
        name: "Classic Burger",
        price: 190,
        description: "Бургер лепче, кари сос, кечап, плескавица, кисели краставички, кромид",
        image: "https://korpa.ba/product_uploads/YLw9ssTP8vRrVWTfzQBprd2rF3OTe6MU.jpg"
      },
      {
        id: "311159",
        name: "Classic Burger Menu",
        price: 310,
        description: "Бургер лепче, кари сос, кечап, плескавица, кисели краставички, кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "311160",
        name: "Chilli Burger",
        price: 240,
        description: "Бургер лепче, говедска плескавица, чедар, доритос лут чипс, ајсберг, кисели краставички, чили сос",
        image: "https://korpa.ba/product_uploads/PuzjCU3j7bCb4dakElqA1JyhNKw0JPmE.jpg"
      },
      {
        id: "311161",
        name: "Chilli Burger Menu",
        price: 360,
        description: "Бургер лепче, говедска плескавица, чедар, доритос лут чипс, ајсберг, кисели краставички, чили сос, помфрит, пијалок",
        image: ""
      },
      {
        id: "311162",
        name: "Walter Junior",
        price: 210,
        description: "Бургер лепче, бургер сос, плескавица, кашкавал, ајсберг, кромид, кисели краставички",
        image: "https://korpa.ba/product_uploads/ZjzubJUXSM1GRu3wq3lB66YtP0W0uF7N.jpg"
      },
      {
        id: "311163",
        name: "Walter Junior Menu",
        price: 330,
        description: "Бургер лепче, бургер сос, плескавица, кашкавал, ајсберг, кромид, кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311164",
        name: "Camembert",
        price: 240,
        description: "Бургер лепче, бургер сос, плескавица, 2x зденка, ајсберг, кисели краставички",
        image: "https://korpa.ba/product_uploads/aoWX1gL3qkDZcusxZS48mVmrZmSQFSgY.jpg"
      },
      {
        id: "311165",
        name: "Camembert Menu",
        price: 360,
        description: "Бургер лепче, бургер сос, плескавица, 2x зденка, ајсберг, кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311166",
        name: "Goodman",
        price: 260,
        description: "Бургер лепче, мед и сенф сос, плескавица, 2x кашкавал, ајсберг, кисели краставички, 3x онион рингс",
        image: "https://korpa.ba/product_uploads/cA5hIqLNmT2itPhRJsvPjOzixi7XMy8c.jpg"
      },
      {
        id: "311167",
        name: "Goodman Menu",
        price: 380,
        description: "Бургер лепче, мед и сенф сос, плескавица, 2x кашкавал, ајсберг, кисели краставички, 3x онион рингс, помфрит, пијалок",
        image: ""
      },
      {
        id: "311168",
        name: "Heisen",
        price: 250,
        description: "Бургер лепче, бургер сос, плескавица, кашкавал, ајсберг, карамелизиран кромид",
        image: "https://korpa.ba/product_uploads/Ewrj9MPkNvXwBgQQxumBrHO1juC0QDLC.jpg"
      },
      {
        id: "311169",
        name: "Heisen Menu",
        price: 370,
        description: "Бургер лепче, бургер сос, плескавица, кашкавал, ајсберг, карамелизиран кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "362125",
        name: "Jalapeno Classic",
        price: 290,
        description: "Бургер лепче, baking bread сос, кисели краставички, говедска плескавица полнета со кашкавал, халапењо пиперчиња, похован кромид",
        image: "https://korpa.ba/product_uploads/ls0SbyI514XlXxkycIeDDmDGnZS7Plcr.jpg"
      }
    ]
  },
  {
    id: "premium-burgers",
    name: "Premium Burgers",
    emoji: "🍔⭐️",
    items: [
      {
        id: "311170",
        name: "Single Smash",
        price: 250,
        description: "Бриож лепче, 100% јунешка плескавица, кашкавал, кечап, сенф, ситно сецкан кромид и кисели краставички",
        image: "https://korpa.ba/product_uploads/FeJWuAbBBFR1ZRO9vpNDsgQsUtdGj9wJ.jpg"
      },
      {
        id: "311171",
        name: "Single Smash Menu",
        price: 360,
        description: "Бриож лепче, 100% јунешка плескавица, кашкавал, кечап, сенф, ситно сецкан кромид и кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311172",
        name: "Premium Cheeseburger (2x smash beef)",
        price: 290,
        description: "Бургер лепче, јамјам сос, премиум јунешка плескавица x2, чедар x2, ајсберг, домат, кисели краставици",
        image: "https://korpa.ba/product_uploads/GEAGPZuOQfT62hm8ITjkQe3IOEIj90qV.jpg"
      },
      {
        id: "311173",
        name: "Premium Cheeseburger (2x smash beef) Menu",
        price: 400,
        description: "Бургер лепче, јамјам сос, премиум јунешка плескавица, чедар x2, ајсберг, домат, кисели краставици, помфрит, пијалок",
        image: ""
      },
      {
        id: "311174",
        name: "Double Cheeseburger",
        price: 290,
        description: "Бриош лебче, 2х смеш плескавици, 2х чедар, кечап, сенф, кромид и кисели краставички",
        image: "https://korpa.ba/product_uploads/DlanCc9V9Pk86fONY1lYiUqkTss4LOfX.jpg"
      },
      {
        id: "311175",
        name: "Double Cheeseburger Menu",
        price: 400,
        description: "Бриош лебче, 2х смеш плескавици, 2х чедар, кечап, сенф, кромид и кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311176",
        name: "Big Mac Burger",
        price: 340,
        description: "Бургер лепче, биг мек сос, 2x смеш плескавици, 2x чедар, ајсберг, ситно сецкан кромид, кисели краставици",
        image: "https://korpa.ba/product_uploads/hp2ElGxW4URCM6BqhUuOPCVA7DsoL1SC.jpg"
      },
      {
        id: "311177",
        name: "Big Mac Burger Menu",
        price: 450,
        description: "Бургер лепче, биг мек сос, 2x смеш плескавици, 2x чедар, ајсберг, ситно сецкан кромид, кисели краставици, помфрит, пијалок",
        image: ""
      },
      {
        id: "311178",
        name: "Jesse Pinkman",
        price: 360,
        description: "Бургер лепче, бургер сос, 2x смеш плескавици, 2x чедар, путер и лук, 3x онион рингс, ајсберг, домат, кисели краставички",
        image: "https://korpa.ba/product_uploads/TNibFS7wy4H06QCncQQgdBQgnoEc6Z3N.jpg"
      },
      {
        id: "311179",
        name: "Jesse Pinkman Menu",
        price: 470,
        description: "Бургер лепче, бургер сос, 2x смеш плескавици, 2x чедар, путер и лук, 3x онион рингс, ајсберг, домат, кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "313644",
        name: "Say Cheese",
        price: 330,
        description: "Бриож лепче, бургер сос, 2x смеш јунешки плескавици, 4x чедар, ајсберг, кисели краставички, карамелизиран кромид",
        image: "https://korpa.ba/product_uploads/6PLEfnfgE6RDdkrti7cYj4g0jT2Yy8wV.jpg"
      },
      {
        id: "313645",
        name: "Say Cheese Menu",
        price: 440,
        description: "Бриож лепче, бургер сос, 2x смеш јунешки плескавици, 4x чедар, ајсберг, кисели краставички, карамелизиран кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "314621",
        name: "The Joker (Тriple smash) Burger",
        price: 350,
        description: "Бриож лепче, кечап, сенф, кисели краставици, кромид, 3х smash плескавици, 3х чедар кашкавал",
        image: "https://korpa.ba/product_uploads/RoVwEWfKgZQ2RsDS696PM2m7mOSBf8g0.jpg"
      },
      {
        id: "314622",
        name: "BBQ Smash Burger",
        price: 300,
        description: "Бриож лепче, гарлик мајо сос, кисели краставици, 2х smash плескавици, 2х чедар, bbq грилован кромид",
        image: "https://korpa.ba/product_uploads/a6AZXAxw0F49Y2qBC0kgmrlGYlJqlBE9.jpg"
      },
      {
        id: "339887",
        name: "Premium Chili Burger",
        price: 360,
        description: "Бриош лепче, две смеш плескавици, ×2чедар, доритос лут чипс, ајсберг, кисели краставички, чили сос",
        image: "https://korpa.ba/product_uploads/P7kkZJFK1G5dKzUTk0joKIxTj6tasZO1.jpg"
      },
      {
        id: "362386",
        name: "Jalapeno Premium",
        price: 330,
        description: "Бургер лепче, baking bread сос, кисели краставички, 2х smash јунешка плескавица со гауда, халапењо пиперчиња. похован кромид",
        image: "https://korpa.ba/product_uploads/gQGqAeuB8Jo100X4yLauX0drNxa6TqLJ.jpg"
      }
    ]
  },
  {
    id: "chicken",
    name: "Chicken",
    emoji: "🍗",
    items: [
      {
        id: "311180",
        name: "Classic Chicken",
        price: 200,
        description: "Бургер лепче, кари сос, кечап, поховано пилешко, кисели краставички, кромид",
        image: "https://korpa.ba/product_uploads/2snb4OXUtQybwNN9QmV51h3UFyTEyIvg.jpg"
      },
      {
        id: "311181",
        name: "Classic Chicken Menu",
        price: 320,
        description: "Бургер лепче, кари сос, кечап, поховано пилешко, кисели краставички, кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "311182",
        name: "Crispy Chicken",
        price: 190,
        description: "Бургер лепче, colslow салата, поховано пилешко",
        image: "https://korpa.ba/product_uploads/l0100g6zIk7ElX3ljjPK38MNJxl0iJdU.jpg"
      },
      {
        id: "311183",
        name: "Crispy Chicken Menu",
        price: 320,
        description: "Бургер лепче, colslow салата, поховано пилешко, помфрит, пијалок",
        image: ""
      },
      {
        id: "311184",
        name: "Crispy Ranch",
        price: 210,
        description: "Бургер лепче, ранч сос, ајсберг, крцкаво пилешко",
        image: ""
      },
      {
        id: "311185",
        name: "Crispy Ranch Menu",
        price: 330,
        description: "Бургер лепче, ранч сос, ајсберг, крцкаво пилешко, помфрит, пијалок",
        image: ""
      },
      {
        id: "311186",
        name: "Los Polos Hermanos",
        price: 240,
        description: "Бургер лепче, мед и сенф сос, поховано пилешко, кашкавал, ајсберг, кисели краставички",
        image: "https://korpa.ba/product_uploads/Ap6v67Z7LU7Z7plSYPCJHWswTcNDZT4R.jpg"
      },
      {
        id: "311187",
        name: "Los Polos Hermanos Menu",
        price: 360,
        description: "Бургер лепче, мед и сенф сос, поховано пилешко, кашкавал, ајсберг, кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311188",
        name: "Chilli Chicken",
        price: 240,
        description: "Бургер лепче, крцкаво похувано пилешко, чедар, ајсберг, кисели краставички, чили сос",
        image: "https://korpa.ba/product_uploads/LNVFojKxsHigVBSKjXpGhCNo7PGNnXGU.jpg"
      },
      {
        id: "311189",
        name: "Chilli Chicken Menu",
        price: 360,
        description: "Бургер лепче, крцкаво похувано пилешко, чедар, ајсберг, кисели краставички, чили сос, помфрит, пијалок",
        image: ""
      },
      {
        id: "339888",
        name: "Winner Winner Chicken Dinner",
        price: 280,
        description: "Бургер лепче, бургер сос, 2x поховано пилешко, чедар, сланина, ајсберг, кисели краставички, кромид",
        image: "https://korpa.ba/product_uploads/FZgGkeijvVEE1XNZ5l4gHYH9yTTS1W4S.jpg"
      }
    ]
  },
  {
    id: "hot-dogs",
    name: "Hot Dogs",
    emoji: "🌭",
    items: [
      {
        id: "311190",
        name: "Classic Dog",
        price: 140,
        description: "Хот дог лепче, виршла, кечап, кари, сенф",
        image: ""
      },
      {
        id: "311191",
        name: "Classic Dog Menu",
        price: 260,
        description: "Хот дог лепче, виршла, кечап, кари, сенф, помфрит, пијалок",
        image: ""
      },
      {
        id: "311192",
        name: "Cheese Dog",
        price: 200,
        description: "Хот дог лепче, виршла, мед и сенф сос, ајсберг, кисели краставици, чедар x3",
        image: ""
      },
      {
        id: "311193",
        name: "Cheese Dog Menu",
        price: 320,
        description: "Хот дог лепче, виршла, мед и сенф сос, ајсберг, кисели краставици, чедар x3, помфрит, пијалок",
        image: ""
      },
      {
        id: "311194",
        name: "Baking Bread Dog",
        price: 220,
        description: "Хот дог лепче, виршла, бургер сос, ајсберг, кисели краставици, чедар x2, карамелизиран кромид, онион рингс x3",
        image: ""
      },
      {
        id: "311195",
        name: "Baking Bread Dog Menu",
        price: 340,
        description: "Хот дог лепче, виршла, бургер сос, ајсберг, кисели краставици, чедар x2, карамелизиран кромид, онион рингс x3, помфрит, пијалок",
        image: ""
      }
    ]
  },
  {
    id: "mini",
    name: "Mini",
    emoji: "🍔",
    items: [
      {
        id: "311196",
        name: "Mini Hamburger",
        price: 130,
        description: "Мини бриош лепче, кари сос, кечап, плескавица, кисели краставички, кромид",
        image: ""
      },
      {
        id: "311197",
        name: "Mini Hamburger Menu",
        price: 250,
        description: "Мини бриош лепче, кари сос, кечап, плескавица, кисели краставички, кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "311198",
        name: "Mini Cheeseburger",
        price: 140,
        description: "Мини бриош лепче, јунешка плескавица, кашкавал, ситно сецкан кромид, кисели краставички, кечап, сенф",
        image: "https://korpa.ba/product_uploads/tmLRoTUnjLSgeNU6U3Rog1Jna4EuDTcl.jpg"
      },
      {
        id: "311199",
        name: "Mini Cheeseburger Menu",
        price: 260,
        description: "Мини бриош лепче, јунешка плескавица, кашкавал, ситно сецкан кромид, кисели краставички, кечап, сенф, помфрит, пијалок",
        image: ""
      },
      {
        id: "311200",
        name: "Mini Chicken Burger",
        price: 130,
        description: "Мини бриош лепче, кари сос, кечап, поховано пилешко, кисели краставички, кромид",
        image: ""
      },
      {
        id: "311201",
        name: "Mini Chicken Burger Menu",
        price: 250,
        description: "Мини бриош лепче, кари сос, кечап, поховано пилешко, кисели краставички, кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "311202",
        name: "Mini Cheese Chicken",
        price: 140,
        description: "",
        image: ""
      },
      {
        id: "311203",
        name: "Mini Cheese Chicken Menu",
        price: 260,
        description: "",
        image: ""
      }
    ]
  },
  {
    id: "nuggets",
    name: "Nuggets",
    emoji: "🍗",
    items: [
      {
        id: "311204",
        name: "Chicken Nuggets (6pcs) + sauce",
        price: 160,
        description: "",
        image: ""
      },
      {
        id: "311205",
        name: "Chicken Nuggets (6pcs) + sauce Menu",
        price: 280,
        description: "",
        image: ""
      },
      {
        id: "311206",
        name: "Chicken Nuggets (9pcs) + sauce",
        price: 200,
        description: "",
        image: ""
      },
      {
        id: "311207",
        name: "Chicken Nuggets (9pcs) + sauce Menu",
        price: 330,
        description: "",
        image: ""
      }
    ]
  },
  {
    id: "wraps",
    name: "Wraps",
    emoji: "🌯",
    items: [
      {
        id: "311208",
        name: "Classic Wrap",
        price: 200,
        description: "Тортиља, поховано пилешко, помфрит, кисели краставички, кари сос",
        image: ""
      },
      {
        id: "311209",
        name: "Classic Wrap Menu",
        price: 320,
        description: "Тортиља, поховано пилешко, помфрит, кисели краставички, кари сос, помфрит, пијалок",
        image: ""
      },
      {
        id: "311210",
        name: "Cezar Wrap",
        price: 210,
        description: "Тортиља, ранч сос, крцкаво поховано пилешко, чедар, ајсберг, кромид",
        image: "https://korpa.ba/product_uploads/0kF0J611CiuFYiAztRd1IFkPCfEmoJ9l.jpg"
      },
      {
        id: "311211",
        name: "Cezar Wrap Menu",
        price: 330,
        description: "Тортиља, ранч сос, крцкаво поховано пилешко, чедар, ајсберг, кромид, помфрит, пијалок",
        image: ""
      },
      {
        id: "311212",
        name: "Los Polos Wrap",
        price: 220,
        description: "Тортиља, мед и сенф сос, поховано пилешко, чедар, ајсберг, кисели краставички",
        image: "https://korpa.ba/product_uploads/G4Ddx6sFzfpuNwFOJZ4NuZt8IeTjXohk.jpg"
      },
      {
        id: "311213",
        name: "Los Polos Wrap Menu",
        price: 340,
        description: "Тортиља, мед и сенф сос, поховано пилешко, чедар, ајсберг, кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311214",
        name: "Baking Bread Wrap",
        price: 240,
        description: "Тортиља, поховано пилешко, чедар, бургер сос, ајсберг, кисели краставички",
        image: ""
      },
      {
        id: "311215",
        name: "Baking Bread Wrap Menu",
        price: 360,
        description: "Тортиља, поховано пилешко, чедар, бургер сос, ајсберг, кисели краставички, помфрит, пијалок",
        image: ""
      },
      {
        id: "311216",
        name: "Big Mac Burito",
        price: 320,
        description: "Тортиља, мелено јунешко месо, чедар x2, ајсберг, кисели краставички, кромид, помфрит, big mac сос",
        image: ""
      },
      {
        id: "311217",
        name: "Big Mac Burito Menu",
        price: 440,
        description: "Тортиља, мелено јунешко месо, чедар x2, ајсберг, кисели краставички, кромид, помфрит, big mac сос, помфрит, пијалок",
        image: ""
      },
      {
        id: "311218",
        name: "Chilli Wrap",
        price: 240,
        description: "Тортиља, крцкаво пилешко, чедар, ајсберг, кисели краставички, чили сос",
        image: "https://korpa.ba/product_uploads/PE16a2w9PXDsAUuW67430dX2CUCuFK3m.jpg"
      },
      {
        id: "311219",
        name: "Chilli Wrap Menu",
        price: 360,
        description: "Тортиља, крцкаво пилешко, чедар, ајсберг, кисели краставички, чили сос, помфрит, пијалок",
        image: ""
      },
      {
        id: "313642",
        name: "Premium Wrap",
        price: 260,
        description: "Тортиља, поховано пилешко, чедар, garlic mayo, honey glazed, ајсберг",
        image: "https://korpa.ba/product_uploads/2XeFGIrLRmtJmxhPXwrYzLfxICXfdIDl.jpg"
      },
      {
        id: "313643",
        name: "Premium Wrap Menu",
        price: 380,
        description: "Тортиља, поховано пилешко, чедар, garlic mayo, honey glazed, ајсберг, помфрит, пијалок",
        image: ""
      }
    ]
  },
  {
    id: "vegevegan",
    name: "Vege/Vegan",
    emoji: "🌿",
    items: [
      {
        id: "314619",
        name: "Vege Burger",
        price: 370,
        description: "Бриож лепче, бургер сос, ајсберг, кисели краставици, веганска плескавица, кашкавал, карамелизиран кромид",
        image: ""
      },
      {
        id: "314620",
        name: "Vegan Burger",
        price: 370,
        description: "Бриож лепче, посен мајонез, кечап, ајсберг, кисели краставици, веганска плескавица, карамелизиран кромид",
        image: ""
      }
    ]
  },
  {
    id: "fries",
    name: "Fries",
    emoji: "🍟",
    items: [
      {
        id: "311220",
        name: "Fries",
        price: 90,
        description: "",
        image: "https://korpa.ba/product_uploads/LNa7LaKi8xwaPR8PHBZsnFPO8ckkUyHE.jpg"
      },
      {
        id: "311221",
        name: "Kanu",
        price: 140,
        description: "",
        image: "https://korpa.ba/product_uploads/SuI1zi5IHhUDL0iRc791oJI0A2Er84aL.jpg"
      },
      {
        id: "358391",
        name: "Cheddar Fries",
        price: 220,
        description: "",
        image: ""
      }
    ]
  },
  {
    id: "sosovi",
    name: "Сосови",
    emoji: "🥣",
    items: [
      {
        id: "328913",
        name: "Бургер сос",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "328914",
        name: "Ранч сос",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "328915",
        name: "Кари сос",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "328916",
        name: "Кечап",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "328917",
        name: "Мед и сенф",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "328918",
        name: "Гарлик мајо",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "328919",
        name: "BBQ сос",
        price: 50,
        description: "",
        image: ""
      },
      {
        id: "358392",
        name: "Топен чедар додаток 50ml",
        price: 60,
        description: "",
        image: ""
      },
      {
        id: "358393",
        name: "Топен чедар додаток 80ml",
        price: 80,
        description: "",
        image: ""
      },
      {
        id: "358394",
        name: "Топен чедар додаток 100ml",
        price: 110,
        description: "",
        image: ""
      },
      {
        id: "358395",
        name: "Топен чедар додаток 250ml",
        price: 260,
        description: "",
        image: ""
      }
    ]
  }
];
